/*********************************************************************
**  KaJe 2015                                                       **
**                                                                  **
**  Erstellt am: čt 4. června 2015 14:43:33                         **
**                                                                  **
**  Geändert am: Pá 05.čen.2015 07:22:12                            **
*********************************************************************/




#include "loginanondlg.h"


LoginAnonDlg::LoginAnonDlg(QWidget * parent):QDialog(parent) {	
	setupUi(this);
	setWindowTitle("Login");
}

//------------------------------------------------------------------------------------------------- 
 
QString LoginAnonDlg::getKey() const {
	return lineEdit->text();	
}

//------------------------------------------------------------------------------------------------- 
 

